<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2024 D'Arcy Services Ltd -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
	<policyNamespaces>
		<target prefix="AOVPNDPC" namespace="DPC.AOVPN.DPCClient" />
	</policyNamespaces>
	<resources minRequiredRevision="1.0" />
	<!-- Copied from Windows.admx to avoid the ADMX crashing when opened on a system prior to Windows 22H2 -->
	<supportedOn>
		<definitions>
			<!--At least Windows Threshold no SERVER-->
			<definition name="SUPPORTED_Windows_10_0_NOSERVER" displayName="$(string.SUPPORTED_Windows_10_0_NOSERVER)">
				<or>
					<range ref="products:MicrosoftWindows" minVersionIndex="14" maxVersionIndex="15"/>
				</or>
			</definition>
			<!--At least Windows 11 22H2 no SERVER -->
			<definition name="SUPPORTED_Windows_11_0_22H2_NOSERVER" displayName="$(string.SUPPORTED_Windows_11_0_22H2_NOSERVER)">
				<or>
					<range ref="products:MicrosoftWindows" minVersionIndex="16" maxVersionIndex="16"/>
				</or>
			</definition>
		</definitions>
	</supportedOn>
	<categories>
		<category name="CAT_DPCCategory" displayName="$(string.CAT_DPCCategory)" explainText="$(string.CAT_DPCCategory_Help)">
			<!-- Root Category-->
		</category>
		<category name="CAT_DPCCategory_B_UserTunnel" displayName="$(string.CAT_DPCCategory_UserTunnel)" explainText="$(string.CAT_DPCCategory_UserTunnel_Help)">
			<parentCategory ref="CAT_DPCCategory" />
		</category>
		<category name="CAT_DPCCategory_C_UserBackupTunnel" displayName="$(string.CAT_DPCCategory_UserBackupTunnel)" explainText="$(string.CAT_DPCCategory_UserBackupTunnel_Help)">
			<parentCategory ref="CAT_DPCCategory" />
		</category>
		<category name="CAT_DPCCategory_A_MachineTunnel" displayName="$(string.CAT_DPCCategory_MachineTunnel)" explainText="$(string.CAT_DPCCategory_MachineTunnel_Help)">
			<parentCategory ref="CAT_DPCCategory" />
		</category>
		<category name="CAT_DPCCategory_B_UserTunnel_Advanced" displayName="$(string.CAT_DPCCategory_TunnelAdvanced)" explainText="$(string.CAT_DPCCategory_TunnelAdvanced_Help)">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
		</category>
		<category name="CAT_DPCCategory_C_UserBackupTunnel_Advanced" displayName="$(string.CAT_DPCCategory_TunnelAdvanced)" explainText="$(string.CAT_DPCCategory_TunnelAdvanced_Help)">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
		</category>

		<category name="CAT_DPCCategory_A_MachineTunnel_Advanced" displayName="$(string.CAT_DPCCategory_TunnelAdvanced)" explainText="$(string.CAT_DPCCategory_TunnelAdvanced_Help)">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
		</category>
		<category name="CAT_DPCCategory_B_UserTunnel_TrafficFilters" displayName="$(string.CAT_DPCCategory_TrafficFilters)" explainText="$(string.CAT_DPCCategory_TrafficFilters_Help)">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
		</category>
		<category name="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" displayName="$(string.CAT_DPCCategory_TrafficFilters)" explainText="$(string.CAT_DPCCategory_TrafficFilters_Help)">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
		</category>
		<category name="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" displayName="$(string.CAT_DPCCategory_TrafficFilters)" explainText="$(string.CAT_DPCCategory_TrafficFilters_Help)">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
		</category>
	</categories>
	<policies>

		<!-- Root Settings -->

		<policy name="DPCCategory_B_MachineTunnel" class="Machine" displayName="$(string.DPCCategory_MachineTunnel)" explainText="$(string.DPCCategory_MachineTunnel_Help)" key="Software\Policies\DPC\DPCClient" valueName="MachineTunnel">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_B_UserTunnel" class="Machine" displayName="$(string.DPCCategory_UserTunnel)" explainText="$(string.DPCCategory_UserTunnel_Help)" key="Software\Policies\DPC\DPCClient" valueName="UserTunnel">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_C_UserBackupTunnel" class="Machine" displayName="$(string.DPCCategory_UserBackupTunnel)" explainText="$(string.DPCCategory_UserBackupTunnel_Help)" key="Software\Policies\DPC\DPCClient" valueName="UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_D_RefreshPeriod" class="Machine" displayName="$(string.DPCCategory_RefreshPeriod)" explainText="$(string.DPCCategory_RefreshPeriod_Help)" presentation="$(presentation.DPCCategory_RefreshPeriod_Pres)" key="Software\Policies\DPC\DPCClient">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_RefreshPeriod_Int" valueName="RefreshPeriod" maxValue="4294967200" minValue="1" />
			</elements>
		</policy>
		<policy name="DPCCategory_F_CleanProfiles" class="Machine" displayName="$(string.DPCCategory_CleanProfiles)" explainText="$(string.DPCCategory_CleanProfiles_Help)" key="Software\Policies\DPC\DPCClient" valueName="RemoveAllProfiles">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_F_ClearDisableProfileList" class="Machine" displayName="$(string.DPCCategory_ClearDisableProfileList)" explainText="$(string.DPCCategory_ClearDisableProfileList_Help)" key="Software\Policies\DPC\DPCClient" valueName="ClearDisableProfileList">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_X_RestartOnPortAlreadyOpen" class="Machine" displayName="$(string.DPCCategory_RestartOnPortAlreadyOpen)" explainText="$(string.DPCCategory_RestartOnPortAlreadyOpen_Help)" key="Software\Policies\DPC\DPCClient" valueName="RestartOnPortAlreadyOpen">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_Y_MTU" class="Machine" displayName="$(string.DPCCategory_MTU)" explainText="$(string.DPCCategory_MTU_Help)" presentation="$(presentation.DPCCategory_MTU_Pres)" key="Software\Policies\DPC\DPCClient">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_MTU_Int" valueName="MTU" maxValue="1400" minValue="576" />
			</elements>
		</policy>
		<policy name="DPCCategory_Z_MigrationBlock" class="Machine" displayName="$(string.DPCCategory_MigrationBlock)" explainText="$(string.DPCCategory_MigrationBlock_Help)" key="Software\Policies\DPC\DPCClient" valueName="MigrationBlock">
			<parentCategory ref="CAT_DPCCategory" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>

		<!-- Machine Tunnel Settings -->

		<policy name="DPCCategory_MachineTunnel_A_ConnectionURL" class="Machine" displayName="$(string.DPCCategory_ConnectionURL)" explainText="$(string.DPCCategory_ConnectionURL_Help)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel" presentation="$(presentation.DPCCategory_MachineTunnel_ConnectionURL_Pres)">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_MachineTunnel_ConnectionURL_TextBox" valueName="URL" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_A_ProfileName" class="Machine" displayName="$(string.DPCCategory_MachineTunnel_ProfileName)" explainText="$(string.DPCCategory_MachineTunnel_ProfileName_Help)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel" presentation="$(presentation.DPCCategory_MachineTunnel_ProfileName_Pres)">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_MachineTunnel_ProfileName_TextBox" valueName="ProfileName" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_A_RouteList" class="Machine" displayName="$(string.DPCCategory_MachineTunnel_RouteList)" explainText="$(string.DPCCategory_MachineTunnel_RouteList_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_RouteList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_MachineTunnel_RouteList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel\RouteList" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_B_RouteListExclude" class="Machine" displayName="$(string.DPCCategory_RouteListExclude)" explainText="$(string.DPCCategory_RouteListExclude_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_RouteListExclude_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_MachineTunnel_RouteListExclude_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel\RouteListExclude" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_B_DNSSuffix" class="Machine" displayName="$(string.DPCCategory_DNSSuffix)" explainText="$(string.DPCCategory_DNSSuffix_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_DNSSuffix_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_MachineTunnel_DNSSuffix_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel\DNSSuffix" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_B_TrustedNetworks" class="Machine" displayName="$(string.DPCCategory_TrustedNetworks)" explainText="$(string.DPCCategory_TrustedNetworks_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_TrustedNetworks_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_MachineTunnel_TrustedNetworks_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel\TrustedNetworks" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_C_RegisterDNS" class="Machine" displayName="$(string.DPCCategory_RegisterDNS)" explainText="$(string.DPCCategory_MachineTunnel_RegisterDNS_Help)" key="Software\Policies\DPC\DPCClient\MachineTunnel" valueName="RegisterDNS">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_MachineTunnel_M_DisableUIDisconnectButton" class="Machine" displayName="$(string.DPCCategory_DisableUIDisconnectButton)" explainText="$(string.DPCCategory_DisableUIDisconnectButton_Help)" key="Software\Policies\DPC\DPCClient\MachineTunnel" valueName="DisableUIDisconnectButton">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_11_0_22H2_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_MachineTunnel_N_DisableUIEditButton" class="Machine" displayName="$(string.DPCCategory_DisableUIEditButton)" explainText="$(string.DPCCategory_DisableUIEditButton_Help)" key="Software\Policies\DPC\DPCClient\MachineTunnel" valueName="DisableUIEditButton">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_11_0_22H2_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_MachineTunnel_Y_SavePath" class="Machine" displayName="$(string.DPCCategory_SavePath)" explainText="$(string.DPCCategory_SavePath_Help)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel" presentation="$(presentation.DPCCategory_MachineTunnel_SavePath_Pres)">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_MachineTunnel_SavePath_TextBox" valueName="SavePath" required="true" />
			</elements>
		</policy>

		<!-- Machine Tunnel Advanced Settings -->

		<policy name="DPCCategory_MachineTunnel_Security" class="Machine" displayName="$(string.DPCCategory_Security)" explainText="$(string.DPCCategory_Security_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_Security_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel" valueName="CustomCryptography">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<enum id="AuthenticationTransformConstants" valueName="AuthenticationTransformConstants">
					<item displayName="$(string.MD596)">
						<value>
							<string>MD596</string>
						</value>
					</item>
					<item displayName="$(string.SHA196)">
						<value>
							<string>SHA196</string>
						</value>
					</item>
					<item displayName="$(string.SHA256128)">
						<value>
							<string>SHA256128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES128)">
						<value>
							<string>GCMAES128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES192)">
						<value>
							<string>GCMAES192</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES256)">
						<value>
							<string>GCMAES256</string>
						</value>
					</item>
				</enum>
				<enum id="CipherTransformConstants" valueName="CipherTransformConstants">
					<item displayName="$(string.DES)">
						<value>
							<string>DES</string>
						</value>
					</item>
					<item displayName="$(string.DES3)">
						<value>
							<string>DES3</string>
						</value>
					</item>
					<item displayName="$(string.AES128)">
						<value>
							<string>AES128</string>
						</value>
					</item>
					<item displayName="$(string.AES192)">
						<value>
							<string>AES192</string>
						</value>
					</item>
					<item displayName="$(string.AES256)">
						<value>
							<string>AES256</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES128)">
						<value>
							<string>GCMAES128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES192)">
						<value>
							<string>GCMAES192</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES256)">
						<value>
							<string>GCMAES256</string>
						</value>
					</item>
				</enum>
				<enum id="PfsGroup" valueName="PfsGroup">
					<item displayName="$(string.PFS1)">
						<value>
							<string>PFS1</string>
						</value>
					</item>
					<item displayName="$(string.PFS2)">
						<value>
							<string>PFS2</string>
						</value>
					</item>
					<item displayName="$(string.PFS2048)">
						<value>
							<string>PFS2048</string>
						</value>
					</item>
					<item displayName="$(string.ECP256)">
						<value>
							<string>ECP256</string>
						</value>
					</item>
					<item displayName="$(string.ECP384)">
						<value>
							<string>ECP384</string>
						</value>
					</item>
					<item displayName="$(string.PFSMM)">
						<value>
							<string>PFSMM</string>
						</value>
					</item>
					<item displayName="$(string.PFS24)">
						<value>
							<string>PFS24</string>
						</value>
					</item>
				</enum>
				<enum id="DHGroup" valueName="DHGroup">
					<item displayName="$(string.Group1)">
						<value>
							<string>Group1</string>
						</value>
					</item>
					<item displayName="$(string.Group2)">
						<value>
							<string>Group2</string>
						</value>
					</item>
					<item displayName="$(string.Group14)">
						<value>
							<string>Group14</string>
						</value>
					</item>
					<item displayName="$(string.ECP256)">
						<value>
							<string>ECP256</string>
						</value>
					</item>
					<item displayName="$(string.ECP384)">
						<value>
							<string>ECP384</string>
						</value>
					</item>
					<item displayName="$(string.Group24)">
						<value>
							<string>Group24</string>
						</value>
					</item>
				</enum>
				<enum id="IntegrityCheckMethod" valueName="IntegrityCheckMethod">
					<item displayName="$(string.MD5)">
						<value>
							<string>MD5</string>
						</value>
					</item>
					<item displayName="$(string.SHA196)">
						<value>
							<string>SHA196</string>
						</value>
					</item>
					<item displayName="$(string.SHA256)">
						<value>
							<string>SHA256</string>
						</value>
					</item>
					<item displayName="$(string.SHA384)">
						<value>
							<string>SHA384</string>
						</value>
					</item>
				</enum>
				<enum id="EncryptionMethod" valueName="EncryptionMethod">
					<item displayName="$(string.DES)">
						<value>
							<string>DES</string>
						</value>
					</item>
					<item displayName="$(string.DES3)">
						<value>
							<string>DES3</string>
						</value>
					</item>
					<item displayName="$(string.AES128)">
						<value>
							<string>AES128</string>
						</value>
					</item>
					<item displayName="$(string.AES192)">
						<value>
							<string>AES192</string>
						</value>
					</item>
					<item displayName="$(string.AES256)">
						<value>
							<string>AES256</string>
						</value>
					</item>
					<item displayName="$(string.AES_GCM_128)">
						<value>
							<string>AES_GCM_128</string>
						</value>
					</item>
					<item displayName="$(string.AES_GCM_256)">
						<value>
							<string>AES_GCM_256</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_ShowDeviceTunnelUI" class="Machine" displayName="$(string.DPCCategory_ShowDeviceTunnelUI)" explainText="$(string.DPCCategory_ShowDeviceTunnelUI_Help)" key="Software\Policies\DPC\DPCClient" valueName="ShowDeviceTunnelInUI">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_MachineTunnel_RouteMetric" class="Machine" displayName="$(string.DPCCategory_RouteMetric)" explainText="$(string.DPCCategory_RouteMetric_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_RouteMetric_Pres)" key="Software\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_MachineTunnel_RouteMetric_Int" valueName="RouteMetric" maxValue="2147483647" minValue="1" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TunnelMetric" class="Machine" displayName="$(string.DPCCategory_TunnelMetric)" explainText="$(string.DPCCategory_TunnelMetric_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_TunnelMetric_Pres)" key="Software\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_MachineTunnel_TunnelMetric_Int" valueName="InterfaceMetric" maxValue="9999" minValue="1" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_DisableRasCredentials" class="Machine" displayName="$(string.DPCCategory_DisableRasCredentials)" explainText="$(string.DPCCategory_DisableRasCredentials_Help)" key="Software\Policies\DPC\DPCClient\MachineTunnel" valueName="DisableRasCredentials">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_MachineTunnel_MachineEKU" class="Machine" displayName="$(string.DPCCategory_MachineTunnel_MachineEKU)" explainText="$(string.DPCCategory_MachineTunnel_MachineEKU_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_MachineEKU_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_MachineTunnel_MachineEKU_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel\MachineEKU" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_NetworkOutageTime" class="Machine" displayName="$(string.DPCCategory_NetworkOutageTime)" explainText="$(string.DPCCategory_NetworkOutageTime_Help)" presentation="$(presentation.DPCCategory_MachineTunnel_NetworkOutageTime_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<enum id="NetworkOutageTime" valueName="NetworkOutageTime">
					<item displayName="$(string.Disabled)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.60S)">
						<value>
							<decimal value="60" />
						</value>
					</item>
					<item displayName="$(string.300S)">
						<value>
							<decimal value="300" />
						</value>
					</item>
					<item displayName="$(string.600S)">
						<value>
							<decimal value="600" />
						</value>
					</item>
					<item displayName="$(string.1200S)">
						<value>
							<decimal value="1200" />
						</value>
					</item>
					<item displayName="$(string.1800S)">
						<value>
							<decimal value="1800" />
						</value>
					</item>
					<item displayName="$(string.3600S)">
						<value>
							<decimal value="3600" />
						</value>
					</item>
					<item displayName="$(string.7200S)">
						<value>
							<decimal value="7200" />
						</value>
					</item>
					<item displayName="$(string.14400S)">
						<value>
							<decimal value="14400" />
						</value>
					</item>
					<item displayName="$(string.28800S)">
						<value>
							<decimal value="28800" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_Y_DebugPath" class="Machine" displayName="$(string.DPCCategory_DebugPath)" explainText="$(string.DPCCategory_DebugPath_Help)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel" presentation="$(presentation.DPCCategory_MachineTunnel_DebugPath_Pres)">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_MachineTunnel_DebugPath_TextBox" valueName="DebugPath" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_Y_OverrideXML" class="Machine" displayName="$(string.DPCCategory_OverrideXML)" explainText="$(string.DPCCategory_OverrideXML_Help)" key="SOFTWARE\Policies\DPC\DPCClient\MachineTunnel" presentation="$(presentation.DPCCategory_MachineTunnel_OverrideXML_Pres)">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<multiText id="DPCCategory_MachineTunnel_OverrideXML_TextBox" valueName="OverrideXML" required="true" maxLength="16000" />
			</elements>
		</policy>
		<!-- User Tunnel Settings -->

		<policy name="DPCCategory_UserTunnel_A_ConnectionURL" class="Machine" displayName="$(string.DPCCategory_ConnectionURL)" explainText="$(string.DPCCategory_ConnectionURL_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" presentation="$(presentation.DPCCategory_UserTunnel_ConnectionURL_Pres)">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_ConnectionURL_TextBox" valueName="URL" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_A_ProfileName" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ProfileName)" explainText="$(string.DPCCategory_UserTunnel_ProfileName_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" presentation="$(presentation.DPCCategory_UserTunnel_ProfileName_Pres)">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_ProfileName_TextBox" valueName="ProfileName" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_B_RootCertificates" class="Machine" displayName="$(string.DPCCategory_UserTunnel_RootCertificates)" explainText="$(string.DPCCategory_UserTunnel_RootCertificates_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RootCertificates_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_RootCertificates_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\RootCertificates" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_C_IssuingCertificates" class="Machine" displayName="$(string.DPCCategory_UserTunnel_IssuingCertificates)" explainText="$(string.DPCCategory_UserTunnel_IssuingCertificates_Help)" presentation="$(presentation.DPCCategory_UserTunnel_IssuingCertificates_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_IssuingCertificates_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\IssuingCertificates" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_D_NPSList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_NPSList)" explainText="$(string.DPCCategory_UserTunnel_NPSList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_NPSList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_NPSList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\NPSList" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_E_ForceTunnel" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ForceTunnel)" explainText="$(string.DPCCategory_UserTunnel_ForceTunnel_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="ForceTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_E_RouteList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_RouteList)" explainText="$(string.DPCCategory_UserTunnel_RouteList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RouteList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_RouteList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\RouteList" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_E_RouteListExclude" class="Machine" displayName="$(string.DPCCategory_RouteListExclude)" explainText="$(string.DPCCategory_RouteListExclude_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RouteListExclude_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_RouteListExclude_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\RouteListExclude" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_F_DNSSuffix" class="Machine" displayName="$(string.DPCCategory_DNSSuffix)" explainText="$(string.DPCCategory_DNSSuffix_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DNSSuffix_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DNSSuffix_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\DNSSuffix" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_F_DomainNameInfo" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DomainNameInfo)" explainText="$(string.DPCCategory_UserTunnel_DomainNameInfo_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DomainNameInfo_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DomainNameInfo_ListBox" key="Software\Policies\DPC\DPCClient\UserTunnel\DomainNameInfo" additive="true" explicitValue="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_G_TrustedNetworks" class="Machine" displayName="$(string.DPCCategory_TrustedNetworks)" explainText="$(string.DPCCategory_TrustedNetworks_Help)" presentation="$(presentation.DPCCategory_UserTunnel_TrustedNetworks_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_TrustedNetworks_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\TrustedNetworks" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_H_RegisterDNS" class="Machine" displayName="$(string.DPCCategory_RegisterDNS)" explainText="$(string.DPCCategory_UserTunnel_RegisterDNS_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="RegisterDNS">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_I_ExcludeOffice365" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ExcludeOffice365)" explainText="$(string.DPCCategory_UserTunnel_ExcludeOffice365_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="ExcludeOffice365">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_J_Proxy" class="Machine" displayName="$(string.DPCCategory_UserTunnel_Proxy)" explainText="$(string.DPCCategory_UserTunnel_Proxy_Help)" presentation="$(presentation.DPCCategory_UserTunnel_Proxy_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" valueName="EnableProxy">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<enum id="ProxyType" valueName="ProxyType">
					<item displayName="$(string.Proxy_PAC)">
						<value>
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.Proxy_Manual)">
						<value>
							<decimal value="2" />
						</value>
					</item>
				</enum>
				<text id="DPCCategory_UserTunnel_ProxyValue" valueName="ProxyValue" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_K_ProxyExclusions" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ProxyExclusions)" explainText="$(string.DPCCategory_UserTunnel_ProxyExclusions_Help)" presentation="$(presentation.DPCCategory_UserTunnel_ProxyExclusions_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_ProxyExclusions_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\ProxyExcludeList" valuePrefix="" />
				<enum id="ProxyBypassForLocal" valueName="ProxyBypassForLocal">
					<item displayName="$(string.Disabled)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Enabled)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_M_DisableUIDisconnectButton" class="Machine" displayName="$(string.DPCCategory_DisableUIDisconnectButton)" explainText="$(string.DPCCategory_DisableUIDisconnectButton_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="DisableUIDisconnectButton">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_11_0_22H2_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_N_DisableUIEditButton" class="Machine" displayName="$(string.DPCCategory_DisableUIEditButton)" explainText="$(string.DPCCategory_DisableUIEditButton_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="DisableUIEditButton">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_11_0_22H2_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_Y_DebugPath" class="Machine" displayName="$(string.DPCCategory_DebugPath)" explainText="$(string.DPCCategory_DebugPath_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" presentation="$(presentation.DPCCategory_UserTunnel_DebugPath_Pres)">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_DebugPath_TextBox" valueName="DebugPath" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_Y_SavePath" class="Machine" displayName="$(string.DPCCategory_SavePath)" explainText="$(string.DPCCategory_SavePath_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" presentation="$(presentation.DPCCategory_UserTunnel_SavePath_Pres)">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_SavePath_TextBox" valueName="SavePath" required="true" />
			</elements>
		</policy>

		<!-- User Tunnel Advanced Settings -->

		<policy name="DPCCategory_UserTunnel_A_VPNStrategy" class="Machine" displayName="$(string.DPCCategory_UserTunnel_VPNStrategy)" explainText="$(string.DPCCategory_UserTunnel_VPNStrategy_Help)" presentation="$(presentation.DPCCategory_UserTunnel_VPNStrategy_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<enum id="VPNStrategy" valueName="VPNStrategy">
					<item displayName="$(string.VPN_SSTPOnly)">
						<value>
							<decimal value="5" />
						</value>
					</item>
					<item displayName="$(string.VPN_SstpFirst)">
						<value>
							<decimal value="6" />
						</value>
					</item>
					<item displayName="$(string.VPN_Ikev2Only)">
						<value>
							<decimal value="7" />
						</value>
					</item>
					<item displayName="$(string.VPN_Ikev2Sstp)">
						<value>
							<decimal value="14" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_B_Security" class="Machine" displayName="$(string.DPCCategory_Security)" explainText="$(string.DPCCategory_Security_Help)" presentation="$(presentation.DPCCategory_UserTunnel_Security_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" valueName="CustomCryptography">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<!-- Documented settings https://docs.microsoft.com/sk-sk/windows/client-management/mdm/vpnv2-csp -->
			<elements>
				<enum id="AuthenticationTransformConstants" valueName="AuthenticationTransformConstants">
					<item displayName="$(string.MD596)">
						<value>
							<string>MD596</string>
						</value>
					</item>
					<item displayName="$(string.SHA196)">
						<value>
							<string>SHA196</string>
						</value>
					</item>
					<item displayName="$(string.SHA256128)">
						<value>
							<string>SHA256128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES128)">
						<value>
							<string>GCMAES128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES192)">
						<value>
							<string>GCMAES192</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES256)">
						<value>
							<string>GCMAES256</string>
						</value>
					</item>
				</enum>
				<enum id="CipherTransformConstants" valueName="CipherTransformConstants">
					<item displayName="$(string.DES)">
						<value>
							<string>DES</string>
						</value>
					</item>
					<item displayName="$(string.DES3)">
						<value>
							<string>DES3</string>
						</value>
					</item>
					<item displayName="$(string.AES128)">
						<value>
							<string>AES128</string>
						</value>
					</item>
					<item displayName="$(string.AES192)">
						<value>
							<string>AES192</string>
						</value>
					</item>
					<item displayName="$(string.AES256)">
						<value>
							<string>AES256</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES128)">
						<value>
							<string>GCMAES128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES192)">
						<value>
							<string>GCMAES192</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES256)">
						<value>
							<string>GCMAES256</string>
						</value>
					</item>
				</enum>
				<enum id="PfsGroup" valueName="PfsGroup">
					<item displayName="$(string.PFS1)">
						<value>
							<string>PFS1</string>
						</value>
					</item>
					<item displayName="$(string.PFS2)">
						<value>
							<string>PFS2</string>
						</value>
					</item>
					<item displayName="$(string.PFS2048)">
						<value>
							<string>PFS2048</string>
						</value>
					</item>
					<item displayName="$(string.ECP256)">
						<value>
							<string>ECP256</string>
						</value>
					</item>
					<item displayName="$(string.ECP384)">
						<value>
							<string>ECP384</string>
						</value>
					</item>
					<item displayName="$(string.PFSMM)">
						<value>
							<string>PFSMM</string>
						</value>
					</item>
					<item displayName="$(string.PFS24)">
						<value>
							<string>PFS24</string>
						</value>
					</item>
				</enum>
				<enum id="DHGroup" valueName="DHGroup">
					<item displayName="$(string.Group1)">
						<value>
							<string>Group1</string>
						</value>
					</item>
					<item displayName="$(string.Group2)">
						<value>
							<string>Group2</string>
						</value>
					</item>
					<item displayName="$(string.Group14)">
						<value>
							<string>Group14</string>
						</value>
					</item>
					<item displayName="$(string.ECP256)">
						<value>
							<string>ECP256</string>
						</value>
					</item>
					<item displayName="$(string.ECP384)">
						<value>
							<string>ECP384</string>
						</value>
					</item>
					<item displayName="$(string.Group24)">
						<value>
							<string>Group24</string>
						</value>
					</item>
				</enum>
				<enum id="IntegrityCheckMethod" valueName="IntegrityCheckMethod">
					<item displayName="$(string.MD5)">
						<value>
							<string>MD5</string>
						</value>
					</item>
					<item displayName="$(string.SHA196)">
						<value>
							<string>SHA196</string>
						</value>
					</item>
					<item displayName="$(string.SHA256)">
						<value>
							<string>SHA256</string>
						</value>
					</item>
					<item displayName="$(string.SHA384)">
						<value>
							<string>SHA384</string>
						</value>
					</item>
				</enum>
				<enum id="EncryptionMethod" valueName="EncryptionMethod">
					<item displayName="$(string.DES)">
						<value>
							<string>DES</string>
						</value>
					</item>
					<item displayName="$(string.DES3)">
						<value>
							<string>DES3</string>
						</value>
					</item>
					<item displayName="$(string.AES128)">
						<value>
							<string>AES128</string>
						</value>
					</item>
					<item displayName="$(string.AES192)">
						<value>
							<string>AES192</string>
						</value>
					</item>
					<item displayName="$(string.AES256)">
						<value>
							<string>AES256</string>
						</value>
					</item>
					<item displayName="$(string.AES_GCM_128)">
						<value>
							<string>AES_GCM_128</string>
						</value>
					</item>
					<item displayName="$(string.AES_GCM_256)">
						<value>
							<string>AES_GCM_256</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_E_DNSRouteList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DNSRouteList)" explainText="$(string.DPCCategory_UserTunnel_DNSRouteList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DNSRouteList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DNSRouteList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\DNSRouteList" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_F_DNSExcludeRouteList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DNSExcludeRouteList)" explainText="$(string.DPCCategory_UserTunnel_DNSExcludeRouteList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DNSExcludeRouteList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DNSExcludeRouteList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\DNSExcludeRouteList" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_RouteMetric" class="Machine" displayName="$(string.DPCCategory_RouteMetric)" explainText="$(string.DPCCategory_RouteMetric_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RouteMetric_Pres)" key="Software\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_UserTunnel_RouteMetric_Int" valueName="RouteMetric" maxValue="2147483647" minValue="1" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TunnelMetric" class="Machine" displayName="$(string.DPCCategory_TunnelMetric)" explainText="$(string.DPCCategory_TunnelMetric_Help)" presentation="$(presentation.DPCCategory_UserTunnel_TunnelMetric_Pres)" key="Software\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_UserTunnel_TunnelMetric_Int" valueName="InterfaceMetric" maxValue="9999" minValue="1" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_NetworkOutageTime" class="Machine" displayName="$(string.DPCCategory_NetworkOutageTime)" explainText="$(string.DPCCategory_NetworkOutageTime_Help)" presentation="$(presentation.DPCCategory_UserTunnel_NetworkOutageTime_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<enum id="NetworkOutageTime" valueName="NetworkOutageTime">
					<item displayName="$(string.Disabled)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.60S)">
						<value>
							<decimal value="60" />
						</value>
					</item>
					<item displayName="$(string.300S)">
						<value>
							<decimal value="300" />
						</value>
					</item>
					<item displayName="$(string.600S)">
						<value>
							<decimal value="600" />
						</value>
					</item>
					<item displayName="$(string.1200S)">
						<value>
							<decimal value="1200" />
						</value>
					</item>
					<item displayName="$(string.1800S)">
						<value>
							<decimal value="1800" />
						</value>
					</item>
					<item displayName="$(string.3600S)">
						<value>
							<decimal value="3600" />
						</value>
					</item>
					<item displayName="$(string.7200S)">
						<value>
							<decimal value="7200" />
						</value>
					</item>
					<item displayName="$(string.14400S)">
						<value>
							<decimal value="14400" />
						</value>
					</item>
					<item displayName="$(string.28800S)">
						<value>
							<decimal value="28800" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_EKU" class="Machine" displayName="$(string.DPCCategory_UserTunnel_EKU)" explainText="$(string.DPCCategory_UserTunnel_EKU_Help)" presentation="$(presentation.DPCCategory_UserTunnel_EKU_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" valueName="LimitEKU">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_UserTunnel_EKU_EKUName" valueName="EKUName" required="true" />
				<text id="DPCCategory_UserTunnel_EKU_EKUOID" valueName="EKUOID" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_DeviceCompliance" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DeviceCompliance)" explainText="$(string.DPCCategory_UserTunnel_DeviceCompliance_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DeviceCompliance_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" valueName="DeviceComplianceEnabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_UserTunnel_DeviceCompliance_EKUOID" valueName="DCEKUOID" required="false" />
				<text id="DPCCategory_UserTunnel_DeviceCompliance_IssuerHash" valueName="DCIssuerHash" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_W_EnableSmartCard" class="Machine" displayName="$(string.DPCCategory_EnableSmartCard)" explainText="$(string.DPCCategory_EnableSmartCard_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="EnableEAPSmartCard">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>

		<policy name="DPCCategory_UserTunnel_X_DisableAlwaysOn" class="Machine" displayName="$(string.DPCCategory_DisableAlwaysOn)" explainText="$(string.DPCCategory_DisableAlwaysOn_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="DisableAlwaysOn">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_X_DisableNPSValidation" class="Machine" displayName="$(string.DPCCategory_DisableNPSValidation)" explainText="$(string.DPCCategory_DisableNPSValidation_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="DisableNPSValidation">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_X_DisableCryptoBinding" class="Machine" displayName="$(string.DPCCategory_DisableCryptoBinding)" explainText="$(string.DPCCategory_DisableCryptoBinding_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="DisableCryptoBinding">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_X_IncludeDeviceTunnelRoutes" class="Machine" displayName="$(string.DPCCategory_IncludeDeviceTunnelRoutes)" explainText="$(string.DPCCategory_IncludeDeviceTunnelRoutes_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="IncludeDeviceTunnelRoutes">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_X_DisableRasCredentials" class="Machine" displayName="$(string.DPCCategory_DisableRasCredentials)" explainText="$(string.DPCCategory_DisableRasCredentials_Help)" key="Software\Policies\DPC\DPCClient\UserTunnel" valueName="DisableRasCredentials">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserTunnel_Y_OverrideXML" class="Machine" displayName="$(string.DPCCategory_OverrideXML)" explainText="$(string.DPCCategory_OverrideXML_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel" presentation="$(presentation.DPCCategory_UserTunnel_OverrideXML_Pres)">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<multiText id="DPCCategory_UserTunnel_OverrideXML_TextBox" valueName="OverrideXML" required="true" maxLength="16000" />
			</elements>
		</policy>

		<!-- Backup user Tunnel Settings -->

		<policy name="DPCCategory_UserBackupTunnel_A_ConnectionURL" class="Machine" displayName="$(string.DPCCategory_ConnectionURL)" explainText="$(string.DPCCategory_ConnectionURL_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" presentation="$(presentation.DPCCategory_UserTunnel_ConnectionURL_Pres)">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_ConnectionURL_TextBox" valueName="URL" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_A_ProfileName" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ProfileName)" explainText="$(string.DPCCategory_UserTunnel_ProfileName_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" presentation="$(presentation.DPCCategory_UserTunnel_ProfileName_Pres)">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_ProfileName_TextBox" valueName="ProfileName" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_B_RootCertificates" class="Machine" displayName="$(string.DPCCategory_UserTunnel_RootCertificates)" explainText="$(string.DPCCategory_UserTunnel_RootCertificates_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RootCertificates_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_RootCertificates_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\RootCertificates" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_C_IssuingCertificates" class="Machine" displayName="$(string.DPCCategory_UserTunnel_IssuingCertificates)" explainText="$(string.DPCCategory_UserTunnel_IssuingCertificates_Help)" presentation="$(presentation.DPCCategory_UserTunnel_IssuingCertificates_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_IssuingCertificates_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\IssuingCertificates" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_D_NPSList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_NPSList)" explainText="$(string.DPCCategory_UserTunnel_NPSList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_NPSList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_NPSList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\NPSList" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_E_ForceTunnel" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ForceTunnel)" explainText="$(string.DPCCategory_UserTunnel_ForceTunnel_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="ForceTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_E_RouteList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_RouteList)" explainText="$(string.DPCCategory_UserTunnel_RouteList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RouteList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_RouteList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\RouteList" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_E_RouteListExclude" class="Machine" displayName="$(string.DPCCategory_RouteListExclude)" explainText="$(string.DPCCategory_RouteListExclude_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RouteListExclude_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_RouteListExclude_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\RouteListExclude" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_F_DNSSuffix" class="Machine" displayName="$(string.DPCCategory_DNSSuffix)" explainText="$(string.DPCCategory_DNSSuffix_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DNSSuffix_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DNSSuffix_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\DNSSuffix" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_F_DomainNameInfo" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DomainNameInfo)" explainText="$(string.DPCCategory_UserTunnel_DomainNameInfo_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DomainNameInfo_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DomainNameInfo_ListBox" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\DomainNameInfo" additive="true" explicitValue="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_G_TrustedNetworks" class="Machine" displayName="$(string.DPCCategory_TrustedNetworks)" explainText="$(string.DPCCategory_TrustedNetworks_Help)" presentation="$(presentation.DPCCategory_UserTunnel_TrustedNetworks_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_TrustedNetworks_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\TrustedNetworks" valuePrefix="" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_H_RegisterDNS" class="Machine" displayName="$(string.DPCCategory_RegisterDNS)" explainText="$(string.DPCCategory_UserTunnel_RegisterDNS_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="RegisterDNS">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_I_ExcludeOffice365" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ExcludeOffice365)" explainText="$(string.DPCCategory_UserTunnel_ExcludeOffice365_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="ExcludeOffice365">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_J_Proxy" class="Machine" displayName="$(string.DPCCategory_UserTunnel_Proxy)" explainText="$(string.DPCCategory_UserTunnel_Proxy_Help)" presentation="$(presentation.DPCCategory_UserTunnel_Proxy_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" valueName="EnableProxy">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<enum id="ProxyType" valueName="ProxyType">
					<item displayName="$(string.Proxy_PAC)">
						<value>
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.Proxy_Manual)">
						<value>
							<decimal value="2" />
						</value>
					</item>
				</enum>
				<text id="DPCCategory_UserTunnel_ProxyValue" valueName="ProxyValue" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_K_ProxyExclusions" class="Machine" displayName="$(string.DPCCategory_UserTunnel_ProxyExclusions)" explainText="$(string.DPCCategory_UserTunnel_ProxyExclusions_Help)" presentation="$(presentation.DPCCategory_UserTunnel_ProxyExclusions_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_ProxyExclusions_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserTunnel\ProxyExcludeList" valuePrefix="" />
				<enum id="ProxyBypassForLocal" valueName="ProxyBypassForLocal">
					<item displayName="$(string.Disabled)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Enabled)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_M_DisableUIDisconnectButton" class="Machine" displayName="$(string.DPCCategory_DisableUIDisconnectButton)" explainText="$(string.DPCCategory_DisableUIDisconnectButton_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="DisableUIDisconnectButton">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_11_0_22H2_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_N_DisableUIEditButton" class="Machine" displayName="$(string.DPCCategory_DisableUIEditButton)" explainText="$(string.DPCCategory_DisableUIEditButton_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="DisableUIEditButton">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_11_0_22H2_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_Y_DebugPath" class="Machine" displayName="$(string.DPCCategory_DebugPath)" explainText="$(string.DPCCategory_DebugPath_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" presentation="$(presentation.DPCCategory_UserTunnel_DebugPath_Pres)">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_DebugPath_TextBox" valueName="DebugPath" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_Y_SavePath" class="Machine" displayName="$(string.DPCCategory_SavePath)" explainText="$(string.DPCCategory_SavePath_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" presentation="$(presentation.DPCCategory_UserTunnel_SavePath_Pres)">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<text id="DPCCategory_UserTunnel_SavePath_TextBox" valueName="SavePath" required="true" />
			</elements>
		</policy>

		<!-- Backup User Advanced Settings-->

		<policy name="DPCCategory_UserBackupTunnel_A_VPNStrategy" class="Machine" displayName="$(string.DPCCategory_UserTunnel_VPNStrategy)" explainText="$(string.DPCCategory_UserTunnel_VPNStrategy_Help)" presentation="$(presentation.DPCCategory_UserTunnel_VPNStrategy_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<enum id="VPNStrategy" valueName="VPNStrategy">
					<item displayName="$(string.VPN_SSTPOnly)">
						<value>
							<decimal value="5" />
						</value>
					</item>
					<item displayName="$(string.VPN_SstpFirst)">
						<value>
							<decimal value="6" />
						</value>
					</item>
					<item displayName="$(string.VPN_Ikev2Only)">
						<value>
							<decimal value="7" />
						</value>
					</item>
					<item displayName="$(string.VPN_Ikev2Sstp)">
						<value>
							<decimal value="14" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_B_Security" class="Machine" displayName="$(string.DPCCategory_Security)" explainText="$(string.DPCCategory_Security_Help)" presentation="$(presentation.DPCCategory_UserTunnel_Security_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" valueName="CustomCryptography">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<!-- Documented settings https://docs.microsoft.com/sk-sk/windows/client-management/mdm/vpnv2-csp -->
			<elements>
				<enum id="AuthenticationTransformConstants" valueName="AuthenticationTransformConstants">
					<item displayName="$(string.MD596)">
						<value>
							<string>MD596</string>
						</value>
					</item>
					<item displayName="$(string.SHA196)">
						<value>
							<string>SHA196</string>
						</value>
					</item>
					<item displayName="$(string.SHA256128)">
						<value>
							<string>SHA256128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES128)">
						<value>
							<string>GCMAES128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES192)">
						<value>
							<string>GCMAES192</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES256)">
						<value>
							<string>GCMAES256</string>
						</value>
					</item>
				</enum>
				<enum id="CipherTransformConstants" valueName="CipherTransformConstants">
					<item displayName="$(string.DES)">
						<value>
							<string>DES</string>
						</value>
					</item>
					<item displayName="$(string.DES3)">
						<value>
							<string>DES3</string>
						</value>
					</item>
					<item displayName="$(string.AES128)">
						<value>
							<string>AES128</string>
						</value>
					</item>
					<item displayName="$(string.AES192)">
						<value>
							<string>AES192</string>
						</value>
					</item>
					<item displayName="$(string.AES256)">
						<value>
							<string>AES256</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES128)">
						<value>
							<string>GCMAES128</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES192)">
						<value>
							<string>GCMAES192</string>
						</value>
					</item>
					<item displayName="$(string.GCMAES256)">
						<value>
							<string>GCMAES256</string>
						</value>
					</item>
				</enum>
				<enum id="PfsGroup" valueName="PfsGroup">
					<item displayName="$(string.PFS1)">
						<value>
							<string>PFS1</string>
						</value>
					</item>
					<item displayName="$(string.PFS2)">
						<value>
							<string>PFS2</string>
						</value>
					</item>
					<item displayName="$(string.PFS2048)">
						<value>
							<string>PFS2048</string>
						</value>
					</item>
					<item displayName="$(string.ECP256)">
						<value>
							<string>ECP256</string>
						</value>
					</item>
					<item displayName="$(string.ECP384)">
						<value>
							<string>ECP384</string>
						</value>
					</item>
					<item displayName="$(string.PFSMM)">
						<value>
							<string>PFSMM</string>
						</value>
					</item>
					<item displayName="$(string.PFS24)">
						<value>
							<string>PFS24</string>
						</value>
					</item>
				</enum>
				<enum id="DHGroup" valueName="DHGroup">
					<item displayName="$(string.Group1)">
						<value>
							<string>Group1</string>
						</value>
					</item>
					<item displayName="$(string.Group2)">
						<value>
							<string>Group2</string>
						</value>
					</item>
					<item displayName="$(string.Group14)">
						<value>
							<string>Group14</string>
						</value>
					</item>
					<item displayName="$(string.ECP256)">
						<value>
							<string>ECP256</string>
						</value>
					</item>
					<item displayName="$(string.ECP384)">
						<value>
							<string>ECP384</string>
						</value>
					</item>
					<item displayName="$(string.Group24)">
						<value>
							<string>Group24</string>
						</value>
					</item>
				</enum>
				<enum id="IntegrityCheckMethod" valueName="IntegrityCheckMethod">
					<item displayName="$(string.MD5)">
						<value>
							<string>MD5</string>
						</value>
					</item>
					<item displayName="$(string.SHA196)">
						<value>
							<string>SHA196</string>
						</value>
					</item>
					<item displayName="$(string.SHA256)">
						<value>
							<string>SHA256</string>
						</value>
					</item>
					<item displayName="$(string.SHA384)">
						<value>
							<string>SHA384</string>
						</value>
					</item>
				</enum>
				<enum id="EncryptionMethod" valueName="EncryptionMethod">
					<item displayName="$(string.DES)">
						<value>
							<string>DES</string>
						</value>
					</item>
					<item displayName="$(string.DES3)">
						<value>
							<string>DES3</string>
						</value>
					</item>
					<item displayName="$(string.AES128)">
						<value>
							<string>AES128</string>
						</value>
					</item>
					<item displayName="$(string.AES192)">
						<value>
							<string>AES192</string>
						</value>
					</item>
					<item displayName="$(string.AES256)">
						<value>
							<string>AES256</string>
						</value>
					</item>
					<item displayName="$(string.AES_GCM_128)">
						<value>
							<string>AES_GCM_128</string>
						</value>
					</item>
					<item displayName="$(string.AES_GCM_256)">
						<value>
							<string>AES_GCM_256</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_E_DNSRouteList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DNSRouteList)" explainText="$(string.DPCCategory_UserTunnel_DNSRouteList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DNSRouteList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DNSRouteList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\DNSRouteList" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_F_DNSExcludeRouteList" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DNSExcludeRouteList)" explainText="$(string.DPCCategory_UserTunnel_DNSExcludeRouteList_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DNSExcludeRouteList_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<list id="DPCCategory_UserTunnel_DNSExcludeRouteList_Listbox" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel\DNSExcludeRouteList" explicitValue="true" additive="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_RouteMetric" class="Machine" displayName="$(string.DPCCategory_RouteMetric)" explainText="$(string.DPCCategory_RouteMetric_Help)" presentation="$(presentation.DPCCategory_UserTunnel_RouteMetric_Pres)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_UserTunnel_RouteMetric_Int" valueName="RouteMetric" maxValue="2147483647" minValue="1" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TunnelMetric" class="Machine" displayName="$(string.DPCCategory_TunnelMetric)" explainText="$(string.DPCCategory_TunnelMetric_Help)" presentation="$(presentation.DPCCategory_UserTunnel_TunnelMetric_Pres)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<decimal id="DPCCategory_UserTunnel_TunnelMetric_Int" valueName="InterfaceMetric" maxValue="9999" minValue="1" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_NetworkOutageTime" class="Machine" displayName="$(string.DPCCategory_NetworkOutageTime)" explainText="$(string.DPCCategory_NetworkOutageTime_Help)" presentation="$(presentation.DPCCategory_UserTunnel_NetworkOutageTime_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<enum id="NetworkOutageTime" valueName="NetworkOutageTime">
					<item displayName="$(string.Disabled)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.60S)">
						<value>
							<decimal value="60" />
						</value>
					</item>
					<item displayName="$(string.300S)">
						<value>
							<decimal value="300" />
						</value>
					</item>
					<item displayName="$(string.600S)">
						<value>
							<decimal value="600" />
						</value>
					</item>
					<item displayName="$(string.1200S)">
						<value>
							<decimal value="1200" />
						</value>
					</item>
					<item displayName="$(string.1800S)">
						<value>
							<decimal value="1800" />
						</value>
					</item>
					<item displayName="$(string.3600S)">
						<value>
							<decimal value="3600" />
						</value>
					</item>
					<item displayName="$(string.7200S)">
						<value>
							<decimal value="7200" />
						</value>
					</item>
					<item displayName="$(string.14400S)">
						<value>
							<decimal value="14400" />
						</value>
					</item>
					<item displayName="$(string.28800S)">
						<value>
							<decimal value="28800" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_EKU" class="Machine" displayName="$(string.DPCCategory_UserTunnel_EKU)" explainText="$(string.DPCCategory_UserTunnel_EKU_Help)" presentation="$(presentation.DPCCategory_UserTunnel_EKU_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" valueName="LimitEKU">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_UserTunnel_EKU_EKUName" valueName="EKUName" required="true" />
				<text id="DPCCategory_UserTunnel_EKU_EKUOID" valueName="EKUOID" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_DeviceCompliance" class="Machine" displayName="$(string.DPCCategory_UserTunnel_DeviceCompliance)" explainText="$(string.DPCCategory_UserTunnel_DeviceCompliance_Help)" presentation="$(presentation.DPCCategory_UserTunnel_DeviceCompliance_Pres)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" valueName="DeviceComplianceEnabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_UserTunnel_DeviceCompliance_EKUOID" valueName="DCEKUOID" required="false" />
				<text id="DPCCategory_UserTunnel_DeviceCompliance_IssuerHash" valueName="DCIssuerHash" required="true" />
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_W_EnableSmartCard" class="Machine" displayName="$(string.DPCCategory_EnableSmartCard)" explainText="$(string.DPCCategory_EnableSmartCard_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="EnableEAPSmartCard">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_X_DisableNPSValidation" class="Machine" displayName="$(string.DPCCategory_DisableNPSValidation)" explainText="$(string.DPCCategory_DisableNPSValidation_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="DisableNPSValidation">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_X_DisableCryptoBinding" class="Machine" displayName="$(string.DPCCategory_DisableCryptoBinding)" explainText="$(string.DPCCategory_DisableCryptoBinding_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="DisableCryptoBinding">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_X_IncludeDeviceTunnelRoutes" class="Machine" displayName="$(string.DPCCategory_IncludeDeviceTunnelRoutes)" explainText="$(string.DPCCategory_IncludeDeviceTunnelRoutes_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="IncludeDeviceTunnelRoutes">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_X_DisableRasCredentials" class="Machine" displayName="$(string.DPCCategory_DisableRasCredentials)" explainText="$(string.DPCCategory_DisableRasCredentials_Help)" key="Software\Policies\DPC\DPCClient\UserBackupTunnel" valueName="DisableRasCredentials">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_Y_OverrideXML" class="Machine" displayName="$(string.DPCCategory_OverrideXML)" explainText="$(string.DPCCategory_OverrideXML_Help)" key="SOFTWARE\Policies\DPC\DPCClient\UserBackupTunnel" presentation="$(presentation.DPCCategory_UserTunnel_OverrideXML_Pres)">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_Advanced" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<elements>
				<multiText id="DPCCategory_UserTunnel_OverrideXML_TextBox" valueName="OverrideXML" required="true" maxLength="16000" />
			</elements>
		</policy>

		<!-- Traffic Filters -->
		<!-- Machine Filters -->
		<policy name="DPCCategory_MachineTunnel_TrafficFilter01" displayName="$(string.DPCCategory_TrafficFilter1)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter1" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter02" displayName="$(string.DPCCategory_TrafficFilter2)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter2" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter03" displayName="$(string.DPCCategory_TrafficFilter3)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter3" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId" />
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter04" displayName="$(string.DPCCategory_TrafficFilter4)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter4" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter05" displayName="$(string.DPCCategory_TrafficFilter5)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter5" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter06" displayName="$(string.DPCCategory_TrafficFilter6)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter6" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter07" displayName="$(string.DPCCategory_TrafficFilter7)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter7" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter08" displayName="$(string.DPCCategory_TrafficFilter8)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter8" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter09" displayName="$(string.DPCCategory_TrafficFilter9)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter9" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter10" displayName="$(string.DPCCategory_TrafficFilter10)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter10" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter11" displayName="$(string.DPCCategory_TrafficFilter11)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter11" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter12" displayName="$(string.DPCCategory_TrafficFilter12)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter12" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter13" displayName="$(string.DPCCategory_TrafficFilter13)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter13" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter14" displayName="$(string.DPCCategory_TrafficFilter14)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter14" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter15" displayName="$(string.DPCCategory_TrafficFilter15)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter15" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter16" displayName="$(string.DPCCategory_TrafficFilter16)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter16" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter17" displayName="$(string.DPCCategory_TrafficFilter17)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter17" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter18" displayName="$(string.DPCCategory_TrafficFilter18)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter18" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter19" displayName="$(string.DPCCategory_TrafficFilter19)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter19" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_MachineTunnel_TrafficFilter20" displayName="$(string.DPCCategory_TrafficFilter20)" key="Software\Policies\DPC\DPCClient\MachineTunnel\TrafficFilters\TrafficFilter20" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_A_MachineTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>

		<!-- Primary User Tunnel-->

		<policy name="DPCCategory_UserTunnel_TrafficFilter01" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter1" displayName="$(string.DPCCategory_TrafficFilter1)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter02" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter2" displayName="$(string.DPCCategory_TrafficFilter2)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter03" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter3" displayName="$(string.DPCCategory_TrafficFilter3)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter04" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter4" displayName="$(string.DPCCategory_TrafficFilter4)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter05" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter5" displayName="$(string.DPCCategory_TrafficFilter5)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter06" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter6" displayName="$(string.DPCCategory_TrafficFilter6)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter07" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter7" displayName="$(string.DPCCategory_TrafficFilter7)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter08" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter8" displayName="$(string.DPCCategory_TrafficFilter8)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter09" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter9" displayName="$(string.DPCCategory_TrafficFilter9)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter10" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter10" displayName="$(string.DPCCategory_TrafficFilter10)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter11" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter11" displayName="$(string.DPCCategory_TrafficFilter11)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter12" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter12" displayName="$(string.DPCCategory_TrafficFilter12)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter13" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter13" displayName="$(string.DPCCategory_TrafficFilter13)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter14" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter14" displayName="$(string.DPCCategory_TrafficFilter14)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter15" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter15" displayName="$(string.DPCCategory_TrafficFilter15)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter16" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter16" displayName="$(string.DPCCategory_TrafficFilter16)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter17" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter17" displayName="$(string.DPCCategory_TrafficFilter17)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter18" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter18" displayName="$(string.DPCCategory_TrafficFilter18)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter19" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter19" displayName="$(string.DPCCategory_TrafficFilter19)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserTunnel_TrafficFilter20" key="Software\Policies\DPC\DPCClient\UserTunnel\TrafficFilters\TrafficFilter20" displayName="$(string.DPCCategory_TrafficFilter20)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_B_UserTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>

		<!-- Backup User Tunnel-->

		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter01" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter1" displayName="$(string.DPCCategory_TrafficFilter1)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter02" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter2" displayName="$(string.DPCCategory_TrafficFilter2)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter03" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter3" displayName="$(string.DPCCategory_TrafficFilter3)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter04" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter4" displayName="$(string.DPCCategory_TrafficFilter4)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter05" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter5" displayName="$(string.DPCCategory_TrafficFilter5)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter06" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter6" displayName="$(string.DPCCategory_TrafficFilter6)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter07" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter7" displayName="$(string.DPCCategory_TrafficFilter7)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter08" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter8" displayName="$(string.DPCCategory_TrafficFilter8)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter09" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter9" displayName="$(string.DPCCategory_TrafficFilter9)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter10" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter10" displayName="$(string.DPCCategory_TrafficFilter10)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter11" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter11" displayName="$(string.DPCCategory_TrafficFilter11)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter12" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter12" displayName="$(string.DPCCategory_TrafficFilter12)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter13" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter13" displayName="$(string.DPCCategory_TrafficFilter13)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter14" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter14" displayName="$(string.DPCCategory_TrafficFilter14)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter15" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter15" displayName="$(string.DPCCategory_TrafficFilter15)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter16" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter16" displayName="$(string.DPCCategory_TrafficFilter16)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter17" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter17" displayName="$(string.DPCCategory_TrafficFilter17)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter18" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter18" displayName="$(string.DPCCategory_TrafficFilter18)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter19" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter19" displayName="$(string.DPCCategory_TrafficFilter19)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="DPCCategory_UserBackupTunnel_TrafficFilter20" key="Software\Policies\DPC\DPCClient\UserBackupTunnel\TrafficFilters\TrafficFilter20" displayName="$(string.DPCCategory_TrafficFilter20)" class="Machine" explainText="$(string.DPCCategory_TrafficFilter_Help)" presentation="$(presentation.DPCCategory_TrafficFilter_Pres)" valueName="Enabled">
			<parentCategory ref="CAT_DPCCategory_C_UserBackupTunnel_TrafficFilters" />
			<supportedOn ref="SUPPORTED_Windows_10_0_NOSERVER" />
			<enabledValue>
				<decimal value="1" />
			</enabledValue>
			<disabledValue>
				<decimal value="0" />
			</disabledValue>
			<elements>
				<text id="DPCCategory_TrafficFilter_AppId" valueName="AppId"/>
				<enum id="DPCCategory_TrafficFilter_Protocol" valueName="Protocol">
					<item displayName="$(string.Any)">
						<value>
							<string>-1</string>
						</value>
					</item>
					<item displayName="$(string.TCP)">
						<value>
							<string>6</string>
						</value>
					</item>
					<item displayName="$(string.UDP)">
						<value>
							<string>17</string>
						</value>
					</item>
					<item displayName="$(string.ICMP)">
						<value>
							<string>1</string>
						</value>
					</item>
				</enum>
				<text id="DPCCategory_TrafficFilter_LocalPorts" valueName="LocalPorts" />
				<text id="DPCCategory_TrafficFilter_RemotePorts" valueName="RemotePorts" />
				<text id="DPCCategory_TrafficFilter_LocalAddresses" valueName="LocalAddresses" />
				<text id="DPCCategory_TrafficFilter_RemoteAddresses" valueName="RemoteAddresses" />
				<enum id="DPCCategory_TrafficFilter_RoutingPolicyType" valueName="RoutingPolicyType">
					<item displayName="$(string.SplitTunnel)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.ForceTunnel)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<enum id="DPCCategory_TrafficFilter_Direction" valueName="Direction">
					<item displayName="$(string.Outbound)">
						<value>
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.Inbound)">
						<value>
							<decimal value="1" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
	</policies>
</policyDefinitions>